RetrieveAll/RequestRetrieveAll.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.Request/1.0.0/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:ProcessRequest>
         <MessageDetails>
         </MessageDetails>
         <RetrieveDetails>         
         </RetrieveDetails>
      </ns:ProcessRequest>
   </soapenv:Body>
</soapenv:Envelope>
